protected/_protected/frontend/views/layouts/_header.php

SELECT * FROM `category` WHERE `status`=TRUE
SELECT * FROM `carousel` WHERE `status`=TRUE ORDER BY `id` DESC
SELECT * FROM `lang` WHERE `id` IN (3, 'en', NULL, NULL, NULL, NULL, NULL)
---
$banner1 = Banners::findOne(['page' => Banners::PAGE_HOME , 'position' => Banners::POSITION_ONE]);
$banner2 = Banners::findOne(['page' => Banners::PAGE_HOME , 'position' => Banners::POSITION_TWO]);

$categories = Category::find()->where(['status' => true])->all();
$carousels = Carousel::find()->where(['status' => true])->orderBy('id desc')->all();
$langs = $langs = \common\models\Lang::find()->where('id != :current_id', [':current_id' => \common\models\Lang::getCurrent()->id])->all();