protected/_protected/frontend/controllers/CategoryController.php

    public function actionIndex(){
        $id = \Yii::$app->request->get('id');
        $category = CategoryTranslate::findOne(['url' => $id]);
        if(!isset($category)){
            throw new HttpException(404 , 'Page not found');
        }
        $subCategories = SubCategory::find()->where(['status' => true])->andWhere(['category_id' => $category->category_id])->all();
---
SELECT * FROM `category_translate` WHERE `url`='oe-iyim'
SELECT * FROM `sub_category` WHERE (`status`=TRUE) AND (`category_id`=14)