protected/_protected/frontend/controllers/ProductController.php

SELECT * FROM `product_translate` WHERE `url`='86'
---
    public function actionView(){

        $id = \Yii::$app->request->get('id');
        $productTranslate = ProductTranslate::findOne(['url' => $id]);