protected/_protected/frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $local = Company::find()->where(['type' => Company::TYPE_LOCAL])->limit(4)->all();
        $foreign = Company::find()->where(['type' => Company::TYPE_FOREIGN])->limit(4)->all();
        $best = Product::find()->where(['status' => true])->orderBy('sort desc')->limit(10)->all();
        $products = Product::find()->where(['status' => true])->orderBy('id desc')->limit(12)->all();
        $blogs = Blog::find()->where(['status' => true])->limit(4)->all();
---
SELECT * FROM `company` WHERE `type`=10 LIMIT 4
SELECT * FROM `company` WHERE `type`=11 LIMIT 4
SELECT * FROM `product` WHERE `status`=TRUE ORDER BY `sort` DESC LIMIT 10
SELECT * FROM `product` WHERE `status`=TRUE ORDER BY `id` DESC LIMIT 12
SELECT * FROM `blog` WHERE `status`=TRUE LIMIT 4